In [1]:
import pandas as pd

In [6]:
data = {
    "Name":["Ram","Shayam","Amit","Roshan","Ramesh","Sachin"],
    "Age":[23,22,24,34,25,30],
    "Salary":[1000,2000,3000,4000,5000,6000],
    "Performance":[88,78,56,45,76,89]
}
df = pd.DataFrame(data)
print(df)

     Name  Age  Salary  Performance
0     Ram   23    1000           88
1  Shayam   22    2000           78
2    Amit   24    3000           56
3  Roshan   34    4000           45
4  Ramesh   25    5000           76
5  Sachin   30    6000           89

In [7]:
data = {
    "Name":["Ram","Shayam","Amit","Roshan","Ramesh","Sachin"],
    "Age":[23,22,24,34,25,30],
    "Salary":[1000,2000,3000,4000,5000,6000],
    "Performance":[88,78,56,45,76,89]
}
df["Bonus"]=df["Salary"]*.1
print(df)

     Name  Age  Salary  Performance  Bonus
0     Ram   23    1000           88  100.0
1  Shayam   22    2000           78  200.0
2    Amit   24    3000           56  300.0
3  Roshan   34    4000           45  400.0
4  Ramesh   25    5000           76  500.0
5  Sachin   30    6000           89  600.0

# Using Insert() method

#.  df.insert(loc,"Columns",some_data)

In [15]:
df.insert(0,"EmployeeID",[10,20,30,40,50,60])
print(df)

   EmployeeID  EnployeeID  Enployee ID    Name  Age  Salary  Performance  \
0          10          10           10     Ram   23    1000           88
1          20          20           20  Shayam   22    2000           78
2          30          30           30    Amit   24    3000           56
3          40          40           40  Roshan   34    4000           45
4          50          50           50  Ramesh   25    5000           76
5          60          60           60  Sachin   30    6000           89

   Bonus
0  100.0
1  200.0
2  300.0
3  400.0
4  500.0
5  600.0

In [22]:
df.dropna(axis=0)
print(df)

   EmployeeID  EnployeeID  Enployee ID    Name  Age  Salary  Performance  \
0          10          10           10     Ram   23  1575.0           88
1          20          20           20  Shayam   22  2100.0           78
2          30          30           30    Amit   24  3150.0           56
3          40          40           40  Roshan   34  4200.0           45
4          50          50           50  Ramesh   25  5250.0           76
5          60          60           60  Sachin   30  6300.0           89

   Bonus
0  100.0
1  200.0
2  300.0
3  400.0
4  500.0
5  600.0

In [19]:
df.dropna(axis=1)
df

,EmployeeID,EnployeeID,Enployee ID,Name,Age,Salary,Performance,Bonus
0,10,10,10,Ram,23,1000,88,100.0
1,20,20,20,Shayam,22,2000,78,200.0
2,30,30,30,Amit,24,3000,56,300.0
3,40,40,40,Roshan,34,4000,45,400.0
4,50,50,50,Ramesh,25,5000,76,500.0
5,60,60,60,Sachin,30,6000,89,600.0

# UPDATING

# df.loc[row_index,"column_Name"] = new_Value

In [20]:
df.loc[0,"Salary"] = 1500
print(df)

   EmployeeID  EnployeeID  Enployee ID    Name  Age  Salary  Performance  \
0          10          10           10     Ram   23    1500           88
1          20          20           20  Shayam   22    2000           78
2          30          30           30    Amit   24    3000           56
3          40          40           40  Roshan   34    4000           45
4          50          50           50  Ramesh   25    5000           76
5          60          60           60  Sachin   30    6000           89

   Bonus
0  100.0
1  200.0
2  300.0
3  400.0
4  500.0
5  600.0

# updating increasing salary by 5%

In [21]:
df["Salary"] = df["Salary"]*1.05
print(df)

   EmployeeID  EnployeeID  Enployee ID    Name  Age  Salary  Performance  \
0          10          10           10     Ram   23  1575.0           88
1          20          20           20  Shayam   22  2100.0           78
2          30          30           30    Amit   24  3150.0           56
3          40          40           40  Roshan   34  4200.0           45
4          50          50           50  Ramesh   25  5250.0           76
5          60          60           60  Sachin   30  6300.0           89

   Bonus
0  100.0
1  200.0
2  300.0
3  400.0
4  500.0
5  600.0

# Dropna

#df.drop(columns = ["ColumnsName","ManyColumns"],inplace=True)

In [24]:
print(df)
df.drop(columns=["EmployeeID"],inplace=True)
print(df)

   EmployeeID  EnployeeID  Enployee ID    Name  Age  Salary  Performance  \
0          10          10           10     Ram   23  1575.0           88
1          20          20           20  Shayam   22  2100.0           78
2          30          30           30    Amit   24  3150.0           56
3          40          40           40  Roshan   34  4200.0           45
4          50          50           50  Ramesh   25  5250.0           76
5          60          60           60  Sachin   30  6300.0           89

   Bonus
0  100.0
1  200.0
2  300.0
3  400.0
4  500.0
5  600.0
   EnployeeID  Enployee ID    Name  Age  Salary  Performance  Bonus
0          10           10     Ram   23  1575.0           88  100.0
1          20           20  Shayam   22  2100.0           78  200.0
2          30           30    Amit   24  3150.0           56  300.0
3          40           40  Roshan   34  4200.0           45  400.0
4          50           50  Ramesh   25  5250.0           76  500.0
5          60           60  Sachin   30  6300.0           89  600.0

In [26]:
df.drop(columns=["EnployeeID"],inplace=True)
print(df)

   Enployee ID    Name  Age  Salary  Performance  Bonus
0           10     Ram   23  1575.0           88  100.0
1           20  Shayam   22  2100.0           78  200.0
2           30    Amit   24  3150.0           56  300.0
3           40  Roshan   34  4200.0           45  400.0
4           50  Ramesh   25  5250.0           76  500.0
5           60  Sachin   30  6300.0           89  600.0

In [28]:
df.drop(columns=["Enployee ID"],inplace=True)
print(df)

     Name  Age  Salary  Performance  Bonus
0     Ram   23  1575.0           88  100.0
1  Shayam   22  2100.0           78  200.0
2    Amit   24  3150.0           56  300.0
3  Roshan   34  4200.0           45  400.0
4  Ramesh   25  5250.0           76  500.0
5  Sachin   30  6300.0           89  600.0

In [29]:
df.insert(0,"EmployeeID",[10,20,30,40,50,60])
print(df)

   EmployeeID    Name  Age  Salary  Performance  Bonus
0          10     Ram   23  1575.0           88  100.0
1          20  Shayam   22  2100.0           78  200.0
2          30    Amit   24  3150.0           56  300.0
3          40  Roshan   34  4200.0           45  400.0
4          50  Ramesh   25  5250.0           76  500.0
5          60  Sachin   30  6300.0           89  600.0